import { Injectable } from '@angular/core';
// import { HttpClientModule } from '@angular/common/http';

@Injectable()
export class LocalVarProvider {
  main: Object[] = [];
  rooms: Object[] = [];

  constructor() {
    console.log('Hello LocalVarProvider Provider');

    let main: object = {
      tab: "Main",
      title: "Maem",
      subtitle: "organic",
      description: `Маєм гарну фасадну терасу на 25 чоловік, а також Lounge bar з низькими диванами, 
      гарною музикою, відео, більярдом... барна стійка з раковиною хол/гар вода, шумоізоляція, витяжка... 
      кальяни для Вашого відпочинку`,
  
      cards: [
        {
          id:1, 
          title: "Кімнати", 
          description: "Чиста вода, свіже повітря, новий ремонт, якісне житло, приватна територія, білизна, прибирання, комуналка, все включено",
          imgUrl: "card-rooms-01.jpg"
        },
        {
          id:2, 
          title: "Баня", 
          description: "Ви маєте зруб з душем і туалетом, парилка, кімнати з лежанками з підігрівом, тераса, озерце, чан, гамак, дрова, сіновал, мангал, шашлик, BBQ, якісна музика, оптоволоконний WiFi",
          imgUrl: "card-sauna-01.jpg"
        },
        {
          id:3, 
          title: "Lounge bar", 
          description: "Lounge bar з низькими диванами, гарною музикою, відео, більярдом",
          imgUrl: "card-lounge-01.jpg"
        }
      ],
  
      btn_txt_more: "Перейти"
    }

    let rooms: object = {
      R1: {
        num: 1,
        name: "",

        available: false,
      },
      R2: {
        num: 2,
        name: "Кімната 2",
        images: [
          "r2_01.jpg",
          "r2_02.jpg",
          "r2_03.jpg"
        ],
        subtitle: "Кімната 2 is red",
        available: true,
      },
      R7: {
        num: 7,
        name: "Кімната 7",
        images: [
          "r7_01.png",
        ],
        subtitle: "Сонячна кімната у довгострокову оренду у приватному будинку",
        description: `
        <p>
        Перевагу спокійним, стабільним, інтелігентним людям =)
        Окрема кімната у теплому красивому приватному будинку у зеленому центрі котеджного містечка у районі ЖК Софія / ЖК Волошковий (Соф.Борщагівка).
        Маршрутки до метро Житомирська або Виставковий центр. Найближча місцева зупинка маршруту №904 - ЖК Волошковий 100 м., частота кожні 10 хв.
        </p>
        <p>
        Ви маєте власну кімнату, ключі, свій сан вузол, міцне ліжко з натурального масиву, плоский ТВ, високошвидкісний оптоволоконний Wi-Fi.
        </p>
        <p>
        Прибирання, прання, прасування. Місце паркування. Камінний зал. На приватній території газони, дерева, кущі, мангал, міні озерце, гамак на двох, чан, сіновал, зруб з натуральними лежанками з підігрівом і т.д...
        </p>
        <p>
        Які Ви маєте переваги, ніж просто житло у квартирі:
        - чиста вода, свіже повітря (ступенева фільтрація)
        - натуральні матеріали, без пластику і т.д...
        - постільна білизна високої якості
        - місце паркування
        - ТВ, WiFi оптоволокно
        - безкоштовна якісна питна вода (для пиття, їжі і т.д.)
        - пом'якшена фільтрована вода для душу (м'яка шкіра, здоров'я...)
        - прибирання, прання (раз на тиждень)
        - прачка для Ваших речей (до 10 кг)
        - камінна зала для обідів і гостей
        - зони загальної рекреації, хол, м'які меблі, столики для гостей, розетки 220 +інет для роботи на комп.
        - переваги приватного дому: дерева, кущі, газони, замкнутий дворик, приватне своєчасне опалення та кондиціонування (регулюється Т⁰) і т.д...
        - додатково - зруб, сіновал, чан, лежанки, озерце і т.д..
        Тобто, якість життя суттєво вище...
        </p>`,
        price: 300,
        available: true,
      }
    }

    for (let value in main) {
      this.main[value] = main[value];
    }
    for (let value in rooms) {
      this.rooms[value] = rooms[value];
    }
  }
}
